In [ ]:
import pandas as pd
import pymysql #pymysql 模組，是用來操作 MySQL 資料庫的套件

# 設定資料庫連線資訊
host = 'localhost'  # 資料庫主機地址
# 如果是遠端主機，請使用遠端主機的 IP 地址或域名
# 如果是本機，則可以使用 'localhost' 或 '127.0.0.1'

port = 3306     # MySQL 預設的連接埠號是 3306
user = 'root'   #使用者名稱，例如 'root'（管理者帳號）

passwd = 'password'   # 資料庫密碼，請根據實際情況修改
db = 'testdb'           # 資料庫名稱，請根據實際情況修改
charset = 'utf8mb4'     # 字符集，通常使用 'utf8mb4' 以支援完整 Unicode（包括 emoji）

# 建立連線
conn = pymysql.connect(host=host, port=port, user=user, passwd=passwd, db=db, charset=charset)
#使用 pymysql.connect(...) 來建立一個資料庫連線物件 conn
#此連線物件可用於：建立 cursor 游標查詢、執行 SQL 指令（查詢、更新、插入等）、提交或回滾交易（commit() / rollback()）

print('Successfully connected!')

Successfully connected!

In [2]:
df = pd.read_sql(
    "select * from world",
    conn,
)

df

C:\Users\Legato\AppData\Local\Temp\ipykernel_40760\3350631688.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(

          name continent     area  population             gdp
0  Afghanistan      Asia   652230    25500100   2034300000000
1      Albania    Europe    28748     2831741   1296000000000
2      Algeria    Africa  2381741    37100000   1886810000000
3      Andorra    Europe      468       78115    371200000000
4       Angola    Africa  1246700    20609294  10099000000000

In [3]:
def big_countries1(world: pd.DataFrame) -> pd.DataFrame:
    return(
        world.loc[
            (world["area"]>=3000000) | (world["population"]>=25000000) ,["name","population","area"]
        ]
    )
    
big_countries1(df)

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741